                                                    DATA WRANGLING

In [1]:
import requests

In [2]:
import numpy as np
import pandas as pd

                                                    TRATANDO DUPLICIDADE

In [3]:
df = pd.DataFrame({'Colun 1': [1, 2, 3, 3, 4, 4],'Colun2':['a','b','c','c','d','e']})

In [4]:
df.head(6)

   Colun 1 Colun2
0        1      a
1        2      b
2        3      c
3        3      c
4        4      d
5        4      e

In [5]:
df.duplicated() #se nao passar argumento ele compara todas as colunas

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [6]:
df.drop_duplicates()

   Colun 1 Colun2
0        1      a
1        2      b
2        3      c
4        4      d
5        4      e

In [7]:
df.head(6)

   Colun 1 Colun2
0        1      a
1        2      b
2        3      c
3        3      c
4        4      d
5        4      e

In [8]:
df2 = df.sort_values('Colun 1')
df2 = df.drop_duplicates(keep='last') #mantem a ultima linha em duplicidade, retirando a primeira
df2.head()

   Colun 1 Colun2
0        1      a
1        2      b
3        3      c
4        4      d
5        4      e

In [9]:
df.drop_duplicates(subset='Colun 1') #faz a exclusao baseando-se somente pela coluna setada, nesse caso retirando o 3 e 0 4 duplicados. RETIRA OS ULTIMOS.

   Colun 1 Colun2
0        1      a
1        2      b
2        3      c
4        4      d

                                                          DATAS

In [10]:
df3 = pd.DataFrame({'data': ['2022-01-01', '2022-01-02', '2022-01-03']})

In [11]:
df3.head()

         data
0  2022-01-01
1  2022-01-02
2  2022-01-03

In [12]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [13]:
df3['data'] = pd.to_datetime(df3['data'])
df3.head()

        data
0 2022-01-01
1 2022-01-02
2 2022-01-03

In [14]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

In [15]:
df4 = pd.DataFrame({'data': ['2022/01/01', '2022/01/02', '2022/01/03']})
df4['data'] = pd.to_datetime(df4['data'], format='%Y/%m/%d')
df4.head()

        data
0 2022-01-01
1 2022-01-02
2 2022-01-03

In [16]:
df4['data_str'] = df4['data'].dt.strftime('%d/%m/%Y')
df4.head()

        data    data_str
0 2022-01-01  01/01/2022
1 2022-01-02  02/01/2022
2 2022-01-03  03/01/2022

In [17]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   data      3 non-null      datetime64[ns]
 1   data_str  3 non-null      object
dtypes: datetime64[ns](1), object(1)
memory usage: 180.0+ bytes

In [18]:
df_data = [f'2023-02-0{i}' for i in np.arange(1, 10, 1)] #1 a 10 de 1 em 1

In [154]:
df_data

['2023-02-01',
 '2023-02-02',
 '2023-02-03',
 '2023-02-04',
 '2023-02-05',
 '2023-02-06',
 '2023-02-07',
 '2023-02-08',
 '2023-02-09']

In [19]:
data_format = [f'2023-04-0{i}' for i in np.arange(1, 10, 1)]

In [20]:
data_format

['2023-04-01',
 '2023-04-02',
 '2023-04-03',
 '2023-04-04',
 '2023-04-05',
 '2023-04-06',
 '2023-04-07',
 '2023-04-08',
 '2023-04-09']

In [21]:
df_format2 = pd.DataFrame({'data1': df_data, 'data2': data_format})

In [22]:
df_format2

        data1       data2
0  2023-02-01  2023-04-01
1  2023-02-02  2023-04-02
2  2023-02-03  2023-04-03
3  2023-02-04  2023-04-04
4  2023-02-05  2023-04-05
5  2023-02-06  2023-04-06
6  2023-02-07  2023-04-07
7  2023-02-08  2023-04-08
8  2023-02-09  2023-04-09

In [23]:
df_format2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data1   9 non-null      object
 1   data2   9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

CONVERTER A DATA DE STR PARA DATE

In [24]:
df_format2['data1'] = pd.to_datetime(df_format2['data1'])
df_format2.head()

       data1       data2
0 2023-02-01  2023-04-01
1 2023-02-02  2023-04-02
2 2023-02-03  2023-04-03
3 2023-02-04  2023-04-04
4 2023-02-05  2023-04-05

In [25]:
df_format2['data2'] = pd.to_datetime(df_format2['data2'])
df_format2.head()

       data1      data2
0 2023-02-01 2023-04-01
1 2023-02-02 2023-04-02
2 2023-02-03 2023-04-03
3 2023-02-04 2023-04-04
4 2023-02-05 2023-04-05

In [26]:
df_format2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data1   9 non-null      datetime64[ns]
 1   data2   9 non-null      datetime64[ns]
dtypes: datetime64[ns](2)
memory usage: 276.0 bytes

In [27]:
df_format2['Anomes1'] = df_format2['data1'].dt.strftime('%Y%m')

In [28]:
df_format2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   data1    9 non-null      datetime64[ns]
 1   data2    9 non-null      datetime64[ns]
 2   Anomes1  9 non-null      object
dtypes: datetime64[ns](2), object(1)
memory usage: 348.0+ bytes

In [29]:
df_format2['data1'].dt.day

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: data1, dtype: int32

In [30]:
df_format2['data1'].dt.month

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
Name: data1, dtype: int32

DIFERENÃ‡A ENTRE DATAS

In [34]:
df_format2['Dias'] = (df_format2['data2'] - df_format2['data1']).dt.days

In [37]:
df_format2['teste'] = df_format2['data1']

In [39]:
df_format2.columns

Index(['data1', 'data2', 'Anomes1', 'Dias', 'teste'], dtype='object')

                                                   AMOSTRAS